In [4]:
import pandas as pd
import numpy as np

# Assignment 1: DataFrame Basics

Hi there!

Can you read in the transactions dataset and report on:

* The number of rows and columns
* The names of the columns
* The datatypes of each column

In [5]:
# A common practice is to create a path variable to pass to read_csv
path = "transactions.csv"

# read in trasactions csv and create DataFrame
transactions = pd.read_csv(path)

# return DataFrame (df)
transactions

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [6]:
# shape of df: 84388 rows, 3 columns (not including index)
transactions.shape

(83488, 3)

In [7]:
# shape of df: 84388 rows. Add 1 to max default index value to get row count
transactions.columns

Index(['date', 'store_nbr', 'transactions'], dtype='object')

In [8]:
# dtypes attribute returns column names and their data types
transactions.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

# Assignment 2: Exploring DataFrames

Hello!

* Can you quickly inspect the first 5 rows of the transactions data? 

* Then, dive a bit more deeply into the data and check if there are any missing values.
* What about the number of unique dates? I want to make sure we didn’t leave any out.
* Finally, can you report the mean, median, min and max of “transactions”?  I want to check for any anomalies in our data.

In [9]:
# Look at top 5 rows with .head()
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [10]:
# use .isna().sum() on df to get missing counts for all columns
transactions.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [15]:
# Use info to determine missing counts - none are missing!
transactions["date"].nunique()

1682

In [17]:
# Use describe to return the specified aggregations (and more!)
transactions["transactions"].describe()
# Среднее, медиана, минимум, максимум
transactions["transactions"].mean()
transactions["transactions"].median()
transactions["transactions"].min()
transactions["transactions"].max()

np.int64(8359)

In [21]:
# Method 1 for unique dates - once you know how to access columns :D

In [ ]:
# Method 2 for unique dates - speecify include="all" to get stats on text columns.

# Exercise 3 - Accessing DataFrames

Hi, starting to dive deeper into this data.

I noticed that the first row is the only one from 2013-01-01.

* Can you get me a copy of the DataFrame that excludes that row, and only includes “store_nbr” and “transactions”?
* Also, can you report the number of unique store numbers?
* Finally, return the total number of transactions in millions

In [19]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [20]:
# skip the first row via slicing

filtered = transactions[transactions["transactions"] > 2000]
# Срез по столбцам
subset = transactions[["store_nbr", "transactions"]]

In [22]:
# calculate sum of store number column

transactions.groupby("store_nbr")["transactions"].sum()

store_nbr
1     2553963
2     3219901
3     5366350
4     2519007
5     2347877
6     3065896
7     2995993
8     4637971
9     3516162
10    1652493
11    3972488
12    1958852
13    1572504
14    2287850
15    2209898
16    1464498
17    2295485
18    2071278
19    2107489
20    1422539
21     842891
22     504156
23    1788171
24    3568206
25    1520362
26    1065059
27    2485687
28    1957594
29     981448
30    1171130
31    2306044
32    1065226
33    1743003
34    3864018
35    1123889
36    1738129
37    2481719
38    2867052
39    2389482
40    2181195
41    1764146
42     802646
43    2182356
44    7273093
45    6201115
46    5990113
47    6535810
48    5107785
49    4574103
50    4384444
51    2873614
52     275393
53    1180082
54    1451290
Name: transactions, dtype: int64

In [ ]:
# Divide sum of transactions by millions to get in units of millions

# Assignment 4: Dropping Data and Duplicates

Hi there!

Can you:

1. Drop the first row of data? We want it permanently removed. 
2. Drop the date column but not in place
3. Return a dataframe that only includes the last row for each of the stores.

Thanks!

In [ ]:
transactions.head()

In [23]:
# drop the first row of data in place
transactions.sort_values("transactions", ascending=False)
# Сортировка по дате
transactions.sort_values("date")

             date  store_nbr  transactions
0      2013-01-01         25           770
26     2013-01-02         30           708
27     2013-01-02         31          1401
28     2013-01-02         32           776
29     2013-01-02         33          1163
...           ...        ...           ...
83455  2017-08-15         22           766
83456  2017-08-15         23           946
83457  2017-08-15         24          2138
83446  2017-08-15         13           842
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [ ]:
# drop date but not in place

In [ ]:
# drop duplicate rows subsetting by store number. keep last entry for each store

# Assignment 5: Missing Data

Hello, 

Can you tell if any dates or prices are missing in the oil dataset?

Then compare the mean of the oil series when filling in with mean vs. filling in with 0.

Thanks!

In [ ]:
oil = pd.read_csv("../retail/oil.csv")

In [ ]:
# info can be used to infer missing counts 1218 - 1175 = 43

In [ ]:
# But usually easier to use isna().sum() - let the computer count for you :D

In [ ]:
# calculate mean of oil series after filling missing values with 0

In [ ]:
# calculate mean of oil series after filling missing values with the mean of oil price

# Assignment 6: Filtering DataFrames

I need some quick research on store 25:

* First, calculate the percentage of times ALL stores had more than 2000 transactions
* Then, calculate the percentage of times store 25 had more than 2000 transactions, and calculate the sum of transactions on these days
* Finally, sum the transactions for stores 25 and 3, that occurred in May or June, and had less than 2000 transactions

In [ ]:
transactions.head()

In [ ]:
# all stores > 2500 percentage occurence

In [ ]:
# Number of times store 25 had > 2000 divided by total days for store 25 to get percent of time it happened

In [ ]:
# Sum of transactions where store 25 had > 2000 transactions

In [ ]:
# sum of transactions for stores 25 and 31 in months May and June on days they had less than 2000 transactions

# Assignment 7: Sorting DataFrames

Hi there,
* Can you get me a dataset that includes the 5 days with the highest transactions counts? Any similarities between them?
* Then, can you get me a dataset sorted by date from earliest to most recent, but with the highest transactions first and the lowest transactions last for each day?
* Finally, sort the columns in reverse alphabetical order. 

Thanks!

In [ ]:
transactions.head()

In [ ]:
# sort dataframe by values in transaction column in descending order (ascending = False)
# then grab first 5 rows to retrieve 5 highest days

In [ ]:
# Sort dataframe by date in ascending order, and trasactions in descending order

In [ ]:
# sort columns in reverse alphabetical order using sort_index on the column axis (1), in descending order

# Assignment 8: Modifying Columns

Just some quick work, but can you send me the transaction data with the columns renamed?

* Rename `transactions` to `transaction_count` and `store_nbr` to `store_number`.
* Reorder the columns so date is first, then store number, then transaction count.

Thanks!

In [ ]:
# Use rename to change column names
# Use reindex, axis=1, to reorder columns (this can also be done by assignment FYI)

# Assignment 9: Column Creation

Just some quick work, but can you send me the transaction data with the columns renamed?

* Create a `pct_to_target` column that divides transactions by 2500.
* Then, create a `met_target` column that returns True if `pct_to_target` is greater than or equal to 1.
* Next, create a `bonus_payable` column that equals 100 if `met_target` is True, and 0 if not. Then sum the bonus payable column.
* Finally, create columns for month and day of week as integers. There is some helper code for these dateparts below.



Thanks!

In [ ]:
transactions.head()

In [ ]:
# target based columns

In [ ]:
# Call sum on "bonus_payable" column to get total sum of bonus paid

# Assignment 10: np.select

Hi there! I need a few columns created.

1. Create a ‘seasonal_bonus’ column that applies to these dates: 
    * All days in December (month = 12)
    * Sundays (day_of_week = 6) in May (month = 5)
    * Mondays (day_of_week = 0) in July (month = 7)
2. Call the December bonus ‘Holiday Bonus’, the May bonus ‘Corporate Month’, and the July bonus ‘Summer Special’. If no bonus applies, the column should display ‘None’. 
3. Finally, calculate the total bonus owed at $100 per day.

Thanks!

In [ ]:
transactions.head()

In [ ]:
# set up the three conditions


# specify outcomes for each condition

# Call the select method, passing in conditions, choices, and a default value of 'None' if no condition met

In [ ]:
# look at frequency for each

In [ ]:
# Use value counts to extract counts of each holiday, 
# slice the series returned by value counts, and sum relevant values before multiply by 100 to get bonus owed

# Assignment 11: Assign 

* Drop the columns that have been created so far (keep only date, store_number, and transaction count), and recreate them using the assign method.
* Then sum the seasonal bonus owed once again to make sure the numbers are correct.

In [ ]:
# Drop columns we created in prior exercises

In [ ]:
# Create same columns with assign

In [ ]:
# Same method as assignment 10

transactions.loc[:, "seasonal_bonus"].value_counts().iloc[1:].sum() * 100

# Assignment 12: Memory Optimization

Reduce the memory usage of the transactions DataFrame to below 5MB.

In [ ]:
transactions.head()

In [ ]:
transactions.info(memory_usage="deep")

In [ ]:
# Note - you may have been more conservative here, and that's OK.
# The main point is reducing memory consumption. Playing it safe is often wise.

transactions = transactions.astype(
    {
        "store_number": "Int8",
        "transaction_count": "Int16",
        "bonus_payable": "Int8",
        "month": "Int8",
        "day_of_week": "Int8",
        "seasonal_bonus": "category",
    }
)

In [ ]:
transactions.head()

In [ ]:
# down to 2.9MB vs. 10.1 to start. Will work on Chandler's grandparents computer!

transactions.info(memory_usage="deep")